---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingTopHeel
source: html/5991a3e5-3d22-5b31-7e0d-d36fde708f21.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingTopHeel Property

"Heel Length"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousFootingTopHeel { get; }
```